// Автоматически сгенерировано. Не редактировать вручную.
// Источник: все буквы из XML-файлов словарей.

export const DIACRITICS: Record<string, { lower: string[]; upper: string[] }> = {
    "a": {
        lower: ["à", "á", "â", "ā", "ă"],
        upper: ["Ā"]
    },
    "c": {
        lower: ["ç"],
        upper: []
    },
    "e": {
        lower: ["è", "é", "ë", "ē", "ĕ"],
        upper: ["Ē"]
    },
    "i": {
        lower: ["í", "î", "ï", "ī", "ĭ"],
        upper: ["Ī"]
    },
    "o": {
        lower: ["ó", "ô", "ö", "ō", "ŏ"],
        upper: ["Ó", "Ō"]
    },
    "u": {
        lower: ["ú", "ü", "ū", "ŭ"],
        upper: ["Ū"]
    },
    "y": {
        lower: ["ý"],
        upper: []
    },
    "α": {
        lower: ["ἀ", "ἁ", "ἂ", "ἃ", "ἄ", "ἅ", "ἆ", "ἇ", "ὰ", "ά", "ᾀ", "ᾁ", "ᾄ", "ᾅ", "ᾆ", "ᾇ", "ᾰ", "ᾱ", "ᾲ", "ᾳ", "ᾴ", "ᾶ", "ᾷ"],
        upper: ["Ἀ", "Ἁ", "Ἄ", "Ἅ", "Ἆ"]
    },
    "ε": {
        lower: ["ἐ", "ἑ", "ἒ", "ἓ", "ἔ", "ἕ", "ὲ", "έ"],
        upper: ["Ἐ", "Ἑ", "Ἔ", "Ἕ"]
    },
    "η": {
        lower: ["ἠ", "ἡ", "ἢ", "ἣ", "ἤ", "ἥ", "ἦ", "ἧ", "ὴ", "ή", "ᾐ", "ᾑ", "ᾒ", "ᾔ", "ᾕ", "ᾖ", "ᾗ", "ῂ", "ῃ", "ῄ", "ῆ", "ῇ"],
        upper: ["Ἠ", "Ἡ", "Ἤ", "Ἥ", "Ἦ"]
    },
    "ι": {
        lower: ["ἰ", "ἱ", "ἲ", "ἳ", "ἴ", "ἵ", "ἶ", "ἷ", "ὶ", "ί", "ῐ", "ῑ", "ϊ", "ῒ", "ΐ", "ῖ", "ῗ"],
        upper: ["Ἰ", "Ἱ", "Ἴ", "Ἵ", "Ἶ"]
    },
    "ο": {
        lower: ["ὀ", "ὁ", "ὂ", "ὃ", "ὄ", "ὅ", "ὸ", "ό"],
        upper: ["Ὀ", "Ὁ", "Ὄ", "Ὅ"]
    },
    "ρ": {
        lower: ["ῤ", "ῥ"],
        upper: ["Ῥ"]
    },
    "υ": {
        lower: ["ὐ", "ὑ", "ὒ", "ὓ", "ὔ", "ὕ", "ὖ", "ὗ", "ὺ", "ύ", "ῠ", "ῡ", "ϋ", "ῢ", "ΰ", "ῦ", "ῧ"],
        upper: ["Ὑ", "Ὕ"]
    },
    "ω": {
        lower: ["ὠ", "ὡ", "ὢ", "ὣ", "ὤ", "ὥ", "ὦ", "ὧ", "ὼ", "ώ", "ᾠ", "ᾡ", "ᾤ", "ᾥ", "ᾦ", "ᾧ", "ῲ", "ῳ", "ῴ", "ῶ", "ῷ"],
        upper: ["Ὠ", "Ὡ", "Ὤ", "Ὥ", "Ὦ", "Ὧ"]
    },
    "е": {
        lower: ["ё"],
        upper: []
    },
};
